Repository: 1009430358/docs
Catalog: locale/*/LC_MESSAGES/tutorial/limit-number-of-elements-*-updated-array.po
Languages: in

source: Limit Number of Elements in an Array after an Update
in: 限制数组元素在更新之后的数量

source: Synopsis
in: 简介

source: Consider an application where users may submit many scores (e.g. for a test), but the application only needs to track the top three test scores.
in: 考虑一个应用：用户可能会提交许多分数（例如一个测试），但是应用仅仅需要追踪测试分数中的前三个就行了。

source: This pattern uses the :update:`$push` operator with the :update:`$each`, :update:`$sort`, and :update:`$slice` modifiers to sort and maintain an array of fixed size.
in: 这个范例使用包含 :update:`$each` ， :update:`$sort` 和 :update:`$slice` 修改符的 :update:`$push` 操作符以排序并且获取一个固定大小的数组。

source: The array elements must be documents in order to use the :update:`$sort` modifier.
in: 这个数组的元素必须为文档，以便使用 :update:`$sort` 修改符。

source: Pattern
in: 例子

source: Consider the following document in the collection ``students``:
in: 考虑 ``students`` 集合中的下列文档：

source: The following update uses the :update:`$push` operator with:
in: 下面的更新使用 :update:`$push` 操作符，包含：

source: the :update:`$each` modifier to append to the array 2 new elements,
in: :update:`$each` 修改符来为数组追加两个新的元素，

source: the :update:`$sort` modifier to order the elements by ascending (``1``) score, and
in: :update:`$sort` 修改符使用按分数递增 (``1``) 的规则来对元素排序，并且

source: the :update:`$slice` modifier to keep the last ``3`` elements of the ordered array.
in: :update:`$slice` 修改符以保留排序数组的最新的 ``3`` 个元素。

source: When using the :update:`$sort` modifier on the array element, access the field in the subdocument element directly instead of using the :term:`dot notation` on the array field.
in: 当使用 :update:`$sort` 修饰符在数组元素上的时候，直接访问子文档元素而不是在数组字段上使用 :term:`dot notation` 。

source: After the operation, the document contains only the top 3 scores in the ``scores`` array:
in: 在这个操作之后，在 ``scores`` 数组里，文档仅仅包含最高的3个分数。
