Repository: 1009430358/docs
Catalog: locale/*/LC_MESSAGES/tutorial/migrate-chunks-*-sharded-cluster.po
Languages: in

source: Migrate Chunks in a Sharded Cluster
in: 在集群中迁移数据块

source: In most circumstances, you should let the automatic :term:`balancer` migrate :term:`chunks <chunk>` between :term:`shards <shard>`. However, you may want to migrate chunks manually in a few cases:
in: 在绝大多数情况下,应该使用自动的 :term:`balancer` 在 :term:`shards <shard>` 之间迁移 :term:`chunks <chunk>` ,不过,有时候也需要手动迁移.

source: When :term:`pre-splitting` an empty collection, migrate chunks manually to distribute them evenly across the shards. Use pre-splitting in limited situations to support bulk data ingestion.
in: 使用 :term:`pre-splitting` 分裂空的集合并手工迁移到每个分片上.在准备批量写入数据时可以这样使用.

source: If the balancer in an active cluster cannot distribute chunks within the :ref:`balancing window <sharding-schedule-balancing-window>`, then you will have to migrate chunks manually.
in: 如果集群数据非常活跃,自动均衡不能在 :ref:`均衡时间窗口 <sharding-schedule-balancing-window>` 内迁移数据,这时需要手工迁移.

source: To manually migrate chunks, use the :dbcommand:`moveChunk` command. For more information on how the automatic balancer moves chunks between shards, see :ref:`sharding-balancing-internals` and :ref:`sharding-chunk-migration`.
in: 使用 :dbcommand:`moveChunk` 手动迁移数据块.参见 :ref:`sharding-balancing-internals` 与 :ref:`sharding-chunk-migration` 获得自动均衡如何在分片间迁移数据块的信息.

source: Example
in: 示例

source: The following example assumes that the field ``username`` is the :term:`shard key` for a collection named ``users`` in the ``myapp`` database, and that the value ``smith`` exists within the :term:`chunk` to migrate. Migrate the chunk using the following command in the :program:`mongo` shell.
in: 以下的例子假设存在数据库 ``myapp``,``users`` 是其中一个集合,片键为 ``username``,要迁移的数据块中有一个片键值 ``smith``.可以在 :program:`mongo` 终端中使用以下命令进行数据块的迁移:

source: This command moves the chunk that includes the shard key value "smith" to the :term:`shard` named ``mongodb-shard3.example.net``. The command will block until the migration is complete.
in: 这个命令将会把含有"smith"的数据块迁移到名字为 ``mongodb-shard3.example.net`` 的 :term:`shard` 上.直到迁移完成命令才会返回.

source: Tip
in: 小技巧

source: To return a list of shards, use the :dbcommand:`listShards` command.
in: 使用 :dbcommand:`listShards` 返回分片列表.

source: To evenly migrate chunks for the ``myapp.users`` collection, put each prefix chunk on the next shard from the other and run the following commands in the mongo shell:
in: 为了均衡地迁移 ``myapp.users`` 集合中的数据块,可以把数据块在各个分片之间逐个迁移,并运行以下命令:

source: See :doc:`/tutorial/create-chunks-in-sharded-cluster` for an introduction to pre-splitting.
in: 参见 :doc:`/tutorial/create-chunks-in-sharded-cluster` 获得预分配的介绍.

source: The :dbcommand:`moveChunk` command has the: ``_secondaryThrottle`` parameter and the ``writeConcern`` parameter that determines when the balancer proceeds with the next document in the migrating chunk. For more information, see :ref:`sharded-cluster-config-secondary-throttle`.
in: 命令 :dbcommand:`moveChunk` 有参数 ``_secondaryThrottle``,如果设置为 ``true``,在数据块进行迁移时,对分片的修改都要同步到 :term:`从节点 <secondary>`,参见 :ref:`sharded-cluster-config-secondary-throttle` 获得更多信息.
