Repository: 1009430358/docs
Catalog: locale/*/LC_MESSAGES/tutorial/split-chunks-*-sharded-cluster.po
Languages: in

source: Split Chunks in a Sharded Cluster
in: 在集群中分裂数据块

source: Normally, MongoDB splits a :term:`chunk` after an insert if the chunk exceeds the maximum :ref:`chunk size <sharding-chunk-size>`. However, you may want to split chunks manually if:
in: 正常情况下,如果数据块的大小已经达到设定的最大值 :ref:`数据块大小 <sharding-chunk-size>` ,MongoDB会在数据再次插入时进行分裂,不过有时候,需要手动进行数据块分裂.

source: you have a large amount of data in your cluster and very few :term:`chunks <chunk>`, as is the case after deploying a cluster using existing data.
in: 在使用已有的数据部署完一个集群之后,可能会发生数据很多,但是集群中的 :term:`chunks <chunk>` 很少的情况.

source: you expect to add a large amount of data that would initially reside in a single chunk or shard. For example, you plan to insert a large amount of data with :term:`shard key` values between ``300`` and ``400``, *but* all values of your shard keys are between ``250`` and ``500`` are in a single chunk.
in: 你希望插入大量的数据,但是这些数据所属的数据块集中在一个分片上.比如,你想插入大量 :term:`shard key` 在 ``300`` 到 ``400`` 之间的数据,*但是* 范围在 ``250`` 到 ``500`` 之间的数据块都在一个分片上.

source: MongoDB provides the :dbcommand:`mergeChunks` command to combine contiguous chunk ranges into a single chunk. See :doc:`/tutorial/merge-chunks-in-sharded-cluster` for more information.
in: MongoDB提供了 :dbcommand:`mergeChunks` 命令将两个邻近的数据块合并为一个数据块,参见 :doc:`/tutorial/merge-chunks-in-sharded-cluster` 获得更多信息.

source: The :term:`balancer` may migrate recently split chunks to a new shard immediately if the move benefits future insertions. The balancer does not distinguish between chunks split manually and those split automatically by the system.
in: 如果 :program:`mongos` 认为以后的写入会从数据迁移中获益,它会立刻将新分裂的数据块迁移到一个新的分片上,均衡器并不区分数据块是人工分裂的还是系统自动分裂的.

source: Be careful when splitting data in a sharded collection to create new chunks. When you shard a collection that has existing data, MongoDB automatically creates chunks to evenly distribute the collection. To split data effectively in a sharded cluster you must consider the number of documents in a chunk and the average document size to create a uniform chunk size. When chunks have irregular sizes, shards may have an equal number of chunks but have very different data sizes. Avoid creating splits that lead to a collection with differently sized chunks.
in: 在已经存在数据的集群中进行数据块分裂要十分小心,MongoDB自动分裂数据块并进行数据均衡,此时进行数据块分裂要考虑到分裂之后各个数据块的大小,如果分裂之后数据块大小变得不规则,有可能出现各个分片间数据块数量均衡但是数据量不均衡的情况.避免做导致数据块大小不均衡的数据块分裂.

source: To split chunks manually, use the :dbcommand:`split` command with either fields ``middle`` or ``find``. The :program:`mongo` shell provides the helper methods :method:`sh.splitFind()` and :method:`sh.splitAt()`.
in: 使用 :dbcommand:`split` 进行数据块分裂,可以使用 ``middle`` 参数或者 ``find`` 参数. :program:`mongo` 提供了:method:`sh.splitFind()` 与 :method:`sh.splitAt()` 的使用帮助.

source: Example
in: 举例

source: The following command splits the chunk that contains the value of ``63109`` for the ``zipcode`` field in the ``people`` collection of the ``records`` database:
in: 下面的命令将 ``records`` 数据库中 ``people`` 集合包含 ``zipcode`` 值为 ``63109`` 的数据块分为两个数据块:

source: Use :method:`~sh.splitAt()` to split a chunk in two, using the queried document as the lower bound in the new chunk:
in: 使用 :method:`~sh.splitAt()` 将数据块分为两个数据块,新数据块使用查询的值作为最小值.

source: The following command splits the chunk that contains the value of ``63109`` for the ``zipcode`` field in the ``people`` collection of the ``records`` database.
in: 下面的命令将 ``records`` 数据库中 ``people`` 集合包含 ``zipcode`` 值为 ``63109`` 的数据块分为两个数据块:
